# 1. Introduction

Welcome to the 2nd part of this course - now that (presumably) you have a solid grasp of the principles surrounding Numerical computing in NumPy, we will move on to data management in Python. The most common way to do this is in **tabular** format (i.e in a table) with relational databases. The most commonly used powerful library which provides in-memory database-like data handling is **Pandas**. Pandas is well suited for:

* **Tabular** data with heterogeneously-typed columns, such as in an SQL database or Excel spreadsheet.
* Ordered and unordered **time-series** data.
* Arbitrary **matrix** data with row and column labels.

Some of the interesting features include:

* Handling missing data fluently
* Size mutability
* Easy-to-use *data alignment*
* Label-based *slicing*, *fancy indexing* and *subsetting*
* Intuitive *merging* and *joining* of datasets by label
* Hierarchical labelling of axes
* Decent IO tools for importing from an array of different formats
* Flexible reshaping and *pivoting* of tables

For advanced information and API, check out the [cookbook](https://pandas.pydata.org/pandas-docs/stable/cookbook.html) and the [website documentation](https://pandas.pydata.org/).

In [3]:
import pandas as pd

**Pandas** is broken down into two primary classes:

1. **Series**: think of this as an any-type (templated) unordered array with an index. A generalized *numpy array*.
2. **DataFrame**: think of this as a 2-D heterogeneous table with a *Series* for each column.

## Series

A series is a one-dimensional labeled array capable of holding **any** data type (integers, strings, floating points, Python objects, etc). The axis labels are collectively referred to as the **index**. The basic method to create a *Series* is to call:

In [4]:
counts = pd.Series(data=[644, 1276, 3554, 154])
counts

0     644
1    1276
2    3554
3     154
dtype: int64

`data` can be many different things:

- a list
- a Python dict
- a `numpy.ndarray`
- a scalar value

We can also specify an **index** which needs to be the same length as `data`. If we don't specify an index, a default sequence of integers (from `np.arange()`) is assigned as the index. A numpy array comprises the values of the *Series*, which the index is another *Pandas* object:

In [5]:
counts.values

array([ 644, 1276, 3554,  154])

In [6]:
counts.index

RangeIndex(start=0, stop=4, step=1)

We can assign meaningful labels to the series, as:

In [7]:
foods = pd.Series([644, 1276, 3554, 154], index=['Oranges', 'Apples', 'Melons', 'Pumpkins'])
foods

Oranges      644
Apples      1276
Melons      3554
Pumpkins     154
dtype: int64

A useful way to think of a *Series* is to use **key-value** pairs, i.e input using a dictionary:

In [8]:
food_d = {
    'Oranges': 644,
    'Apples': 1276,
    'Melons': 3554,
    'Pumpkins': 154
}

pd.Series(food_d)

Oranges      644
Apples      1276
Melons      3554
Pumpkins     154
dtype: int64

This can also be achieved via separate lists:

In [9]:
labels = ['Oranges', 'Apples', 'Melons', 'Pumpkins']
counts = [644, 1276, 3554, 154]
pd.Series(dict(zip(labels,counts)))

Oranges      644
Apples      1276
Melons      3554
Pumpkins     154
dtype: int64

## DataFrame

A dataframe is a 2-dimensional labeled data structure with columns of potentially different types. You can think of it like a spreadsheet or SQL table, or a dictionary of Series objects. It is generally the most commonly used Pandas object. Like Series, DataFrame accepts different kinds of input:

- Dict of 1D `numpy.ndarray`s, lists, dicts, or Series
- 2-D `numpy.ndarray`
- A Series
- Another `DataFrame`

Along with the data you can optionally pass **index** and **columns** arguments. If you pass an index and/or columns, you are guaranteeing the index and/or columns of the resulting DataFrame. Thus, a dict of Series plus a specific index will discard all data not matching up to the passed index.

One of the really nice aspects about Dataframes, particularly in Jupyter notebook, is the automatic HTML/Javascript generated when visualizing tables:

In [10]:
data = pd.DataFrame({'value': [632, 1638, 569, 115, 433, 1130, 754, 555],
                     'patient': [1, 1, 1, 1, 2, 2, 2, 2],
                     'phylum': ['Firmicutes', 'Proteobacteria', 'Actinobacteria', 
                                'Bacteroidetes', 'Firmicutes', 'Proteobacteria',
                                'Actinobacteria', 'Bacteroidetes']})
data

   value  patient          phylum
0    632        1      Firmicutes
1   1638        1  Proteobacteria
2    569        1  Actinobacteria
3    115        1   Bacteroidetes
4    433        2      Firmicutes
5   1130        2  Proteobacteria
6    754        2  Actinobacteria
7    555        2   Bacteroidetes

For most datasets it is impractical to display all the values, there are methods to only view the first $n$ rows: head by default only views the first 5 rows.

In [11]:
data.head()

   value  patient          phylum
0    632        1      Firmicutes
1   1638        1  Proteobacteria
2    569        1  Actinobacteria
3    115        1   Bacteroidetes
4    433        2      Firmicutes

We can extract the column names as:

In [12]:
data.columns

Index(['value', 'patient', 'phylum'], dtype='object')

If you pass in a dict of Series or data that *varies among the number of rows*, the resulting **index** will be the **union** of the indexes of the various Series. With nested dicts, these will first be converted to Series. If no columns are passed, the columns will be the ordered lsit of dictionary keys:

In [13]:
d = {
    "one": pd.Series([1., 2., 3.], index=["a","b","c"]),
    "two": pd.Series([1., 2., 3., 4.], index=["a","b","c","d"])    
}
df = pd.DataFrame(d)
df

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0

If we overwrite the index when creating such a DataFrame, only the indexes/columns selected in the `DataFrame` constructor will be **unionised**:

In [14]:
df = pd.DataFrame(d, index=["b","d","a"], columns=["two","three"])
df

   two three
b  2.0   NaN
d  4.0   NaN
a  1.0   NaN

## Reading and Writing Files

The Pandas I/O API is a set of top level reader functions accessed like `pandas.read_csv()` that generally return a Pandas object. The corresponding *writer* functions are object methods that accessed like `DataFrame.to_csv()`. Below is a table containing a sample of different readers and writers:

| Format Type | Data Description | Reader  | Writer |
| ----- | ---- | ------ | ----- | 
| text | CSV | `read_csv` | `to_csv` |
| text | JSON | `read_json` | `to_json` |
| text | HTML | `read_html` | `to_html` |
| binary | MS Excel | `read_excel` | `to_excel` |
| binary | HDF5 format | `read_hdf` | `to_hdf` |
| SQL | SQL | `read_sql` | `to_sql` |

Some important parameters to functions like `read_csv()` include:

- __filepath__: The path to the file or URL
- __sep__: The delimiter to use (for instance .csv is comma-separated, other favourites are tab-delimited \t)
- __header__: The row number to use a column names (and the start of the data)
- __index_col__: The column to use as row labels of the DataFrame
- __prefix__: Allows a prefix to be added to the column names

In [63]:
titanic = pd.read_excel("datasets/titanic.xlsx")
titanic.head()

,PassengerId,Age,Cabin,Port Embarked,Fare,Name,n_parents,Pclass,Sex,n_siblings,Survived,Ticket
0,1,22.0,NaN,Southampton,7.2500,"Braund, Mr. Owen Harris",0,3rd class,male,1,0,A/5 21171
1,2,38.0,C85,Cherbourg,71.2833,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,1st class,female,1,1,PC 17599
2,3,26.0,NaN,Southampton,7.9250,"Heikkinen, Miss. Laina",0,3rd class,female,0,1,STON/O2. 3101282
3,4,35.0,C123,Southampton,53.1000,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,1st class,female,1,1,113803
4,5,35.0,NaN,Southampton,8.0500,"Allen, Mr. William Henry",0,3rd class,male,0,0,373450

We can also extract from csv or any other flat-file k-delimited style format. This can be specified in the 'sep' argument within a call to `read_csv` or `read_table`.

## Database checks

There are a number of very important checks that anyone should do to a dataset before beginning to manipulate it. Factors such as *missing data* or errors relating to the import process **must** be addressed before going further.

Checking the size of the dataset is a priority:

In [16]:
titanic.shape

(1309, 12)

As well as determining the number of missing values from each column:

In [17]:
titanic.count()

PassengerId      1309
Age              1046
Cabin             295
Port Embarked    1307
Fare             1308
Name             1309
n_parents        1309
Pclass           1309
Sex              1309
n_siblings       1309
Survived         1309
Ticket           1309
dtype: int64

## Querying, Selection

We can select passengers by the row, using `.loc[]`. Loc can also give us a dataframe and is multidimensional.

In [18]:
titanic.loc[3]

PassengerId                                                 4
Age                                                        35
Cabin                                                    C123
Port Embarked                                     Southampton
Fare                                                     53.1
Name             Futrelle, Mrs. Jacques Heath (Lily May Peel)
n_parents                                                   0
Pclass                                              1st class
Sex                                                    female
n_siblings                                                  1
Survived                                                    1
Ticket                                                 113803
Name: 3, dtype: object

Or values by including a column term

In [19]:
titanic.loc[3, 'Age']

35.0

We can select a column using the square-bracket notation [] or using direct.dot notation:

In [20]:
titanic.Age
titanic['Age'].head()

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: Age, dtype: float64

Like NumPy, we can index and select using similar methods:

In [21]:
titanic.Age[:5]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: Age, dtype: float64

In [22]:
titanic[2:10:2]

,PassengerId,Age,Cabin,Port Embarked,Fare,Name,n_parents,Pclass,Sex,n_siblings,Survived,Ticket
2,3,26.0,NaN,Southampton,7.9250,"Heikkinen, Miss. Laina",0,3rd class,female,0,1,STON/O2. 3101282
4,5,35.0,NaN,Southampton,8.0500,"Allen, Mr. William Henry",0,3rd class,male,0,0,373450
6,7,54.0,E46,Southampton,51.8625,"McCarthy, Mr. Timothy J",0,1st class,male,0,0,17463
8,9,27.0,NaN,Southampton,11.1333,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",2,3rd class,female,0,1,347742

Given that this dataset is by passengers, it would be wise to set PassengerID as the index, as such:

In [23]:
titanic = titanic.set_index("PassengerId")
titanic.head()

,Age,Cabin,Port Embarked,Fare,Name,n_parents,Pclass,Sex,n_siblings,Survived,Ticket
PassengerId,,,,,,,,,,,
1,22.0,NaN,Southampton,7.2500,"Braund, Mr. Owen Harris",0,3rd class,male,1,0,A/5 21171
2,38.0,C85,Cherbourg,71.2833,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,1st class,female,1,1,PC 17599
3,26.0,NaN,Southampton,7.9250,"Heikkinen, Miss. Laina",0,3rd class,female,0,1,STON/O2. 3101282
4,35.0,C123,Southampton,53.1000,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,1st class,female,1,1,113803
5,35.0,NaN,Southampton,8.0500,"Allen, Mr. William Henry",0,3rd class,male,0,0,373450

We can quickly subset the dataset using boolean operators:

These can be done directly, such as:

    [pandas.Series] < $value
    
Or function-chained using pre-defined functions:

    - pandas.Series.lt (less than)
    - pandas.Series.gt (greater than)
    - pandas.Series.eq (equals)
    - pandas.Series.neq (not equal to)
    - pandas.Series.lte (less than or equal to)
    - pandas.Series.gte (greater than or equal to)

In [24]:
titanic.Age.lt(30).values

array([ True, False,  True, ..., False, False, False])

In [25]:
titanic[titanic.Age > 30].head()

,Age,Cabin,Port Embarked,Fare,Name,n_parents,Pclass,Sex,n_siblings,Survived,Ticket
PassengerId,,,,,,,,,,,
2,38.0,C85,Cherbourg,71.2833,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,1st class,female,1,1,PC 17599
4,35.0,C123,Southampton,53.1000,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,1st class,female,1,1,113803
5,35.0,NaN,Southampton,8.0500,"Allen, Mr. William Henry",0,3rd class,male,0,0,373450
7,54.0,E46,Southampton,51.8625,"McCarthy, Mr. Timothy J",0,1st class,male,0,0,17463
12,58.0,C103,Southampton,26.5500,"Bonnell, Miss. Elizabeth",0,1st class,female,0,1,113783

Or select columns between two identified as:

In [26]:
titanic.loc[:3, "Cabin":"Fare"]

            Cabin Port Embarked     Fare
PassengerId
1             NaN   Southampton   7.2500
2             C85     Cherbourg  71.2833
3             NaN   Southampton   7.9250

Alternatively, we can index using the absolute *position* using `iloc[]`.

In [27]:
titanic.iloc[1, 2]

'Cherbourg'

In [28]:
titanic.iloc[1]

Age                                                             38
Cabin                                                          C85
Port Embarked                                            Cherbourg
Fare                                                       71.2833
Name             Cumings, Mrs. John Bradley (Florence Briggs Th...
n_parents                                                        0
Pclass                                                   1st class
Sex                                                         female
n_siblings                                                       1
Survived                                                         1
Ticket                                                    PC 17599
Name: 2, dtype: object

We can use the `isin()` method to search if a value or values exist within a Series:

In [29]:
titanic['Port Embarked'].isin(['Cherbourg']).head()

PassengerId
1    False
2     True
3    False
4    False
5    False
Name: Port Embarked, dtype: bool

We can find all the indices where the condition is met, and returns the values that satisfy the condition but retains the shape of the original dataframe, which is crucial when alignment is required:

In [30]:
import numpy as np
x = pd.DataFrame(np.random.rand(5,7))
x.where(x < 0.5)

          0         1         2         3         4         5         6
0  0.199523  0.098554  0.120893  0.103143  0.243530       NaN  0.239833
1  0.442040  0.027230  0.004912       NaN       NaN  0.206555  0.282015
2  0.196058       NaN  0.367728  0.041149       NaN       NaN  0.450441
3  0.255488       NaN       NaN  0.229643       NaN  0.267318  0.209497
4  0.313444  0.399245  0.419080  0.045900  0.013642  0.019849  0.030797

Alternatively, instead of just getting NaNs, we could place a value or an array into the 'other' argument of `where`.

In [31]:
x.where(x < 0.5, other=-x)

          0         1         2         3         4         5         6
0  0.199523  0.098554  0.120893  0.103143  0.243530 -0.525630  0.239833
1  0.442040  0.027230  0.004912 -0.638637 -0.999756  0.206555  0.282015
2  0.196058 -0.715675  0.367728  0.041149 -0.608561 -0.667456  0.450441
3  0.255488 -0.543840 -0.878018  0.229643 -0.577312  0.267318  0.209497
4  0.313444  0.399245  0.419080  0.045900  0.013642  0.019849  0.030797

In [32]:
x.where(x > 0.5, other=lambda y: y**3-1)

          0         1         2         3         4         5         6
0 -0.992057 -0.999043 -0.998233 -0.998903 -0.985557  0.525630 -0.986205
1 -0.913626 -0.999980 -1.000000  0.638637  0.999756 -0.991187 -0.977571
2 -0.992464  0.715675 -0.950274 -0.999930  0.608561  0.667456 -0.908607
3 -0.983323  0.543840  0.878018 -0.987890  0.577312 -0.980898 -0.990805
4 -0.969205 -0.936362 -0.926398 -0.999903 -0.999997 -0.999992 -0.999971

Selection using `query()` feels an awful lot like SQL, which can take raw variables as part of it using @

In [33]:
n_parents = 2
titanic.query("(Age < 25) & ((Pclass == '1st class') | (n_parents == @n_parents))").head()

,Age,Cabin,Port Embarked,Fare,Name,n_parents,Pclass,Sex,n_siblings,Survived,Ticket
PassengerId,,,,,,,,,,,
28,19.0,C23 C25 C27,Southampton,263.0000,"Fortune, Mr. Charles Alexander",2,1st class,male,3,0,19950
44,3.0,NaN,Cherbourg,41.5792,"Laroche, Miss. Simonne Marie Anne Andree",2,2nd class,female,1,1,SC/Paris 2123
59,5.0,NaN,Southampton,27.7500,"West, Miss. Constance Mirium",2,2nd class,female,1,1,C.A. 34651
60,11.0,NaN,Southampton,46.9000,"Goodwin, Master. William Frederick",2,3rd class,male,5,0,CA 2144
64,4.0,NaN,Southampton,27.9000,"Skoog, Master. Harald",2,3rd class,male,3,0,347088

## Aggregation

The toys of NumPy are back in a similar form: max, min, mean, sum etc.

In [34]:
titanic.sum()

Age                                                     31255.7
Fare                                                    43550.5
Name          Braund, Mr. Owen HarrisCumings, Mrs. John Brad...
n_parents                                                   504
Pclass        3rd class1st class3rd class1st class3rd class3...
Sex           malefemalefemalefemalemalemalemalemalefemalefe...
n_siblings                                                  653
Survived                                                    494
Ticket        A/5 21171PC 17599STON/O2. 31012821138033734503...
dtype: object

In [35]:
titanic.Age.mean()

29.881137667304014

In [36]:
titanic.describe()

               Age         Fare    n_parents   n_siblings     Survived
count  1046.000000  1308.000000  1309.000000  1309.000000  1309.000000
mean     29.881138    33.295479     0.385027     0.498854     0.377387
std      14.413493    51.758668     0.865560     1.041658     0.484918
min       0.170000     0.000000     0.000000     0.000000     0.000000
25%      21.000000     7.895800     0.000000     0.000000     0.000000
50%      28.000000    14.454200     0.000000     0.000000     0.000000
75%      39.000000    31.275000     0.000000     1.000000     1.000000
max      80.000000   512.329200     9.000000     8.000000     1.000000

We could check the correlation between two factors. By default this uses **Pearson** correlation, which assumes a linear relationship. This could be changed using the `method` parameter.

In [37]:
titanic.Fare.corr(titanic.Age)

0.17873985599964118

Or generate the correlation matrix, with variance as the diagonal (=1).

In [38]:
titanic.corr()

                 Age      Fare  n_parents  n_siblings  Survived
Age         1.000000  0.178740  -0.150917   -0.243699 -0.053695
Fare        0.178740  1.000000   0.221539    0.160238  0.233622
n_parents  -0.150917  0.221539   1.000000    0.373587  0.108919
n_siblings -0.243699  0.160238   0.373587    1.000000  0.002370
Survived   -0.053695  0.233622   0.108919    0.002370  1.000000

We can choose to aggregate by more than one feature, to generate a `pandas.DataFrame` whereby the index/column names become the type of aggregation we desire:

In [39]:
titanic.agg(['min','max'])

,Age,Fare,Name,n_parents,Pclass,Sex,n_siblings,Survived,Ticket
min,0.17,0.0000,"Abbing, Mr. Anthony",0,1st class,female,0,0,110152
max,80.00,512.3292,"van Melkebeke, Mr. Philemon",9,3rd class,male,8,1,WE/P 5735

Or we can select sets of aggregations to only apply to certain columns:

In [40]:
titanic.agg({'Fare': ['mean','std'], 'Age': ['min', 'max']})

           Fare    Age
max         NaN  80.00
mean  33.295479    NaN
min         NaN   0.17
std   51.758668    NaN

Or we can apply another operation not found in Pandas but in NumPy, or our own, as:

In [41]:
titanic[['Age','Fare','n_parents','n_siblings']].dropna().apply(np.median)

Age           28.00
Fare          15.75
n_parents      0.00
n_siblings     0.00
dtype: float64

In [42]:
def age_fare_ratio(x):
    if (x.Fare > 0.):
        return x.Age / x.Fare
    else:
        return 0.

titanic['Age_Fare_rat'] = titanic.apply(age_fare_ratio, axis=1)
titanic.head()

,Age,Cabin,Port Embarked,Fare,Name,n_parents,Pclass,Sex,n_siblings,Survived,Ticket,Age_Fare_rat
PassengerId,,,,,,,,,,,,
1,22.0,NaN,Southampton,7.2500,"Braund, Mr. Owen Harris",0,3rd class,male,1,0,A/5 21171,3.034483
2,38.0,C85,Cherbourg,71.2833,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,1st class,female,1,1,PC 17599,0.533084
3,26.0,NaN,Southampton,7.9250,"Heikkinen, Miss. Laina",0,3rd class,female,0,1,STON/O2. 3101282,3.280757
4,35.0,C123,Southampton,53.1000,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,1st class,female,1,1,113803,0.659134
5,35.0,NaN,Southampton,8.0500,"Allen, Mr. William Henry",0,3rd class,male,0,0,373450,4.347826

One of the most powerful forms of aggregation is **groupby**. This allows us to perform an aggregation function not *only on one column*, but on multiple ones, allowing us to control for different factors:

In [43]:
titanic.groupby(['Sex',"Pclass"]).agg(['mean', 'std'])

                        Age                   Fare            n_parents  \
                       mean        std        mean        std      mean
Sex    Pclass
female 1st class  37.037594  14.272460  109.412385  82.885854  0.472222
       2nd class  27.499223  12.911747   23.234827  11.239817  0.650943
       3rd class  22.185329  12.205254   15.324250  11.786512  0.731481
male   1st class  41.029272  14.578529   69.888385  74.079427  0.279330
       2nd class  30.815380  13.977400   19.904946  14.775149  0.192982
       3rd class  25.962264  11.682415   12.415462  11.261638  0.255578

                           n_siblings            Survived            \
                       std       mean       std      mean       std
Sex    Pclass
female 1st class  0.774998   0.555556  0.666667  0.979167  0.143325
       2nd class  0.862361   0.500000  0.636209  0.943396  0.232182
       3rd class  1.262014   0.791667  1.446126  0.666667  0.472500
male   1st class  0.653571   0.340782  0.541597  0.251397  0.435033
       2nd class  0.488886   0.327485  0.551260  0.099415  0.300097
       3rd class  0.788377   0.470588  1.218775  0.095335  0.293975

                 Age_Fare_rat
                         mean       std
Sex    Pclass
female 1st class     0.537688  0.479183
       2nd class     1.508919  1.040279
       3rd class     2.036906  1.404201
male   1st class     0.903206  0.792811
       2nd class     1.920682  1.301327
       3rd class     2.883671  1.709359

## Sorting, Ranking

In [44]:
titanic.sort_values(by='Age', ascending=False).head(3)

,Age,Cabin,Port Embarked,Fare,Name,n_parents,Pclass,Sex,n_siblings,Survived,Ticket,Age_Fare_rat
PassengerId,,,,,,,,,,,,
631,80.0,A23,Southampton,30.000,"Barkworth, Mr. Algernon Henry Wilson",0,1st class,male,0,1,27042,2.666667
988,76.0,C46,Southampton,78.850,"Cavendish, Mrs. Tyrell William (Julia Florence...",0,1st class,female,1,1,19877,0.963855
852,74.0,NaN,Southampton,7.775,"Svensson, Mr. Johan",0,3rd class,male,0,0,347060,9.517685

In [45]:
titanic.sort_index(ascending=False).head(3)

,Age,Cabin,Port Embarked,Fare,Name,n_parents,Pclass,Sex,n_siblings,Survived,Ticket,Age_Fare_rat
PassengerId,,,,,,,,,,,,
1309,NaN,NaN,Cherbourg,22.3583,"Peter, Master. Michael J",1,3rd class,male,1,0,2668,NaN
1308,NaN,NaN,Southampton,8.0500,"Ware, Mr. Frederick",0,3rd class,male,0,0,359309,NaN
1307,38.5,NaN,Southampton,7.2500,"Saether, Mr. Simon Sivertsen",0,3rd class,male,0,0,SOTON/O.Q. 3101262,5.310345

In [46]:
titanic.sort_values(by=['n_parents','Fare'], ascending=[False,True]).head()

,Age,Cabin,Port Embarked,Fare,Name,n_parents,Pclass,Sex,n_siblings,Survived,Ticket,Age_Fare_rat
PassengerId,,,,,,,,,,,,
1234,NaN,NaN,Southampton,69.550,"Sage, Mr. John George",9,3rd class,male,1,0,CA. 2343,NaN
1257,NaN,NaN,Southampton,69.550,"Sage, Mrs. John (Annie Bullen)",9,3rd class,female,1,1,CA. 2343,NaN
679,43.0,NaN,Southampton,46.900,"Goodwin, Mrs. Frederick (Augusta Tyler)",6,3rd class,female,1,0,CA 2144,0.916844
1031,40.0,NaN,Southampton,46.900,"Goodwin, Mr. Charles Frederick",6,3rd class,male,1,0,CA 2144,0.852878
886,39.0,NaN,Queenstown,29.125,"Rice, Mrs. William (Margaret Norton)",5,3rd class,female,0,0,382652,1.339056

We can `rank()` each value relative to the others if desired:

In [47]:
titanic.Fare.rank().head()

PassengerId
1     108.5
2    1155.5
3     349.0
4    1091.5
5     391.5
Name: Fare, dtype: float64

## Counts

We can count the number of unique values in a column with `value_counts()` - incredibly useful!

In [48]:
titanic.Survived.value_counts()

0    815
1    494
Name: Survived, dtype: int64

In [49]:
titanic.Sex.value_counts()

male      843
female    466
Name: Sex, dtype: int64

## Handling Complex String columns

We may wish to break down the 'name' category into title, first and last names.

In [50]:
titanic.Name.head()

PassengerId
1                              Braund, Mr. Owen Harris
2    Cumings, Mrs. John Bradley (Florence Briggs Th...
3                               Heikkinen, Miss. Laina
4         Futrelle, Mrs. Jacques Heath (Lily May Peel)
5                             Allen, Mr. William Henry
Name: Name, dtype: object

In [51]:
complex_names = titanic.Name.str.extract("(?P<Surname>[a-zA-Z]+),\s(?P<Title>[a-zA-Z]+).\s(?P<Forename>[a-zA-Z]+)",
                         expand=True)
complex_names.head()

               Surname Title Forename
PassengerId
1               Braund    Mr     Owen
2              Cumings   Mrs     John
3            Heikkinen  Miss    Laina
4             Futrelle   Mrs  Jacques
5                Allen    Mr  William

In [52]:
# or alternatively, splitting a string by a common character, such as comma
titanic.Name.str.split(" ", expand=True).head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13
PassengerId,,,,,,,,,,,,,,
1,"Braund,",Mr.,Owen,Harris,None,None,None,None,None,None,None,None,None,None
2,"Cumings,",Mrs.,John,Bradley,(Florence,Briggs,Thayer),None,None,None,None,None,None,None
3,"Heikkinen,",Miss.,Laina,None,None,None,None,None,None,None,None,None,None,None
4,"Futrelle,",Mrs.,Jacques,Heath,(Lily,May,Peel),None,None,None,None,None,None,None
5,"Allen,",Mr.,William,Henry,None,None,None,None,None,None,None,None,None,None

And now we can join the *complex names* back to the original dataset along the columns-axis. Note that if the indexes did not overlap properly, the **union** of the indexes would be generated.

In [53]:
# make a new titanic with names appended!
titanic = pd.concat([ complex_names, titanic ], axis=1)
titanic.head()

,Surname,Title,Forename,Age,Cabin,Port Embarked,Fare,Name,n_parents,Pclass,Sex,n_siblings,Survived,Ticket,Age_Fare_rat
PassengerId,,,,,,,,,,,,,,,
1,Braund,Mr,Owen,22.0,NaN,Southampton,7.2500,"Braund, Mr. Owen Harris",0,3rd class,male,1,0,A/5 21171,3.034483
2,Cumings,Mrs,John,38.0,C85,Cherbourg,71.2833,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,1st class,female,1,1,PC 17599,0.533084
3,Heikkinen,Miss,Laina,26.0,NaN,Southampton,7.9250,"Heikkinen, Miss. Laina",0,3rd class,female,0,1,STON/O2. 3101282,3.280757
4,Futrelle,Mrs,Jacques,35.0,C123,Southampton,53.1000,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,1st class,female,1,1,113803,0.659134
5,Allen,Mr,William,35.0,NaN,Southampton,8.0500,"Allen, Mr. William Henry",0,3rd class,male,0,0,373450,4.347826

## Tasks

You'll be working with the **tips dataset**, which contains data regarding customers in a restaurant, how much they paid and tipped, and some characteristics about the customers such as whether they smoked or not. Most of the data is preprocessed for you already.

In [64]:
tips = pd.read_csv("datasets/tips.csv")
tips.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

### Task 1

Select all of the customers that ate at dinner time, didn't smoke, and paid more than \$25 for their total bill **or** tipped more than \$4.

In [65]:
tips.query("((total_bill > 25) | (tip > 4)) & (smoker == 'No') & (time == 'Dinner')")

     total_bill   tip     sex smoker  day    time  size
5         25.29  4.71    Male     No  Sun  Dinner     4
7         26.88  3.12    Male     No  Sun  Dinner     4
11        35.26  5.00  Female     No  Sun  Dinner     4
20        17.92  4.08    Male     No  Sat  Dinner     2
23        39.42  7.58    Male     No  Sat  Dinner     4
28        21.70  4.30    Male     No  Sat  Dinner     2
39        31.27  5.00    Male     No  Sat  Dinner     3
44        30.40  5.60    Male     No  Sun  Dinner     4
46        22.23  5.00    Male     No  Sun  Dinner     2
47        32.40  6.00    Male     No  Sun  Dinner     4
48        28.55  2.05    Male     No  Sun  Dinner     3
52        34.81  5.20  Female     No  Sun  Dinner     4
54        25.56  4.34    Male     No  Sun  Dinner     4
57        26.41  1.50  Female     No  Sat  Dinner     2
59        48.27  6.73    Male     No  Sat  Dinner     4
104       20.92  4.08  Female     No  Sat  Dinner     2
112       38.07  4.00    Male     No  Sun  Dinner     3
114       25.71  4.00  Female     No  Sun  Dinner     3
116       29.93  5.07    Male     No  Sun  Dinner     4
155       29.85  5.14  Female     No  Sun  Dinner     5
156       48.17  5.00    Male     No  Sun  Dinner     6
167       31.71  4.50    Male     No  Sun  Dinner     4
185       20.69  5.00    Male     No  Sun  Dinner     5
212       48.33  9.00    Male     No  Sat  Dinner     4
238       35.83  4.67  Female     No  Sat  Dinner     3
239       29.03  5.92    Male     No  Sat  Dinner     3

### Task 2

Calculate the Pearson correlation between the total bill per customer and the tip.

In [66]:
tips[["total_bill","tip"]].corr()

            total_bill       tip
total_bill    1.000000  0.675734
tip           0.675734  1.000000

### Task 3

Calculate the mean total bill and tip per customer, by day and gender.

In [67]:
tips.groupby(["day","sex"]).agg({"total_bill":"mean", "tip":"mean"})

             total_bill       tip
day  sex
Fri  Female   14.145556  2.781111
     Male     19.857000  2.693000
Sat  Female   19.680357  2.801786
     Male     20.802542  3.083898
Sun  Female   19.872222  3.367222
     Male     21.887241  3.220345
Thur Female   16.715312  2.575625
     Male     18.714667  2.980333

### Task 4

Sort customers by the tips and by smokers, and select the top 10 tippers who smoke.

In [68]:
tips.sort_values(by=["smoker","tip"], ascending=[False,False]).iloc[:10,:]

     total_bill    tip     sex smoker   day    time  size
170       50.81  10.00    Male    Yes   Sat  Dinner     3
183       23.17   6.50    Male    Yes   Sun  Dinner     4
214       28.17   6.50  Female    Yes   Sat  Dinner     3
181       23.33   5.65    Male    Yes   Sun  Dinner     2
211       25.89   5.16    Male    Yes   Sat  Dinner     4
172        7.25   5.15    Male    Yes   Sun  Dinner     2
73        25.28   5.00  Female    Yes   Sat  Dinner     2
83        32.68   5.00    Male    Yes  Thur   Lunch     2
197       43.11   5.00  Female    Yes  Thur   Lunch     4
95        40.17   4.73    Male    Yes   Fri  Dinner     4

### Task 5

What is the correlation between the total bill and the tip?

In [62]:
tips[["total_bill","tip"]].corr()

            total_bill       tip
total_bill    1.000000  0.675734
tip           0.675734  1.000000